cfd_geometry/tesla_cybertruck/roof_carrier_box/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    tarmac
    {
        type            zeroGradient;
    }
    upperArea
    {
        type            zeroGradient;
    }
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    lateralArea
    {
        type            zeroGradient;
    }
    symmetryPlane
    {
        type            symmetry;
    }
    bodyCassoneChiusoPortapacchi_mm
    {
        type            zeroGradient;
    }
    FR_mm
    {
        type            zeroGradient;
    }
    RR_mm
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
